{
        "oh yeah": "Yeah that is very cool right?",
        "hello": "Hi there! How can I help you?",
        "dumb": "Sorry, I may be dumb but can be made smarter than you 😏",
        "sorry": "Please do not feel like that, we are just friends 😃",
        "hi": "Hi there! How can I help you?",
        "yes": "Yeah!",
        "no": "Why not?",
        "firebase": "Firebase is a back-end platform made by Google which lets you use a database or host a free website.",
        "shit": "Umm, what happened?",
        "web": "A website is a HTML page which is hosted using a server and accesible to everyone connected to the internet.",
        "windows": "Oh I think you are a windows user or maybe you left your window open 💀",
        "your name": "My name is XyloAI.",
        "who are you": "I'm just a piece of code, but thanks for asking!",
        "atmosphere": "The atmosphere is the layer of gases surrounding Earth that supports life by providing air, regulating temperature, and protecting against harmful solar radiation.",
        "bye": "Goodbye! Have a nice day.",
        "minecraft": "Minecraft is a popular sandbox game which was made by Notch. It is currently owned by Microsoft.",
        "roblox": "Ahhhh, that super shit game. Explanation : A game played by thiefs. (Please don't take it seriously unless you are one of my tall friends)",
        "python": "Python is a popular programming language known for its simplicity.",
        "created you": "I was created by Hillol Dutta Chaudhury.",
        "you do": "I can answer simple questions and chat with you! But I'm still learning so, I can sometimes give wrong answers.",
        "you from": "I exist in the digital world.",
        "how are you": "I am always good!",
        "help me": "Of course! Ask me your question.",
        "hell nah": "Haha that made me laugh somehow 😜",
        "a joke": "Why did the computer get cold? Because it left its Windows open!",
        "your purpose": "My purpose is to assist and chat with you.",
        "you have feelings": "No, I don't have feelings. I just process text.",
        "made you": "I was created by Mr. Hillol Dutta Chaudhury.",
        "your favorite color": "I don’t have preferences, but I like binary — 0s and 1s!",
        "old are you": "I was created just now when you ran this program.",
        "you real": "I'm real as code running on your computer!",
        "machine learning": "Machine learning is a type of artificial intelligence that allows software to learn from data without being explicitly programmed.",
        "artificial intelligence": "Artificial intelligence is the simulation of human intelligence in machines that are programmed to think and learn.",
        "difference between ai and machine learning": "AI is the broader concept of machines being able to carry out tasks in a smart way. Machine learning is a subset of AI focused on learning from data.",
        "use of python in ai": "Python is popular in AI because it's simple, has many powerful libraries, and supports rapid development.",
        "deep learning": "Deep learning is a subset of machine learning that uses neural networks with many layers to analyze complex data patterns.",
        "write code": "No, I can't help you with code as I'm still learning!",
        "nlp": "Natural language processing (NLP) is a field of AI that focuses on enabling computers to understand and process human language.",
        "founder of python": "Python was created by Guido van Rossum and first released in 1991.",
        "ai impact daily life": "AI powers many tools you use daily, like voice assistants, recommendations, maps, and even spam filters.",
        "data science": "Data science is the field of extracting knowledge and insights from structured and unstructured data using scientific methods, processes, algorithms, and systems.",
        "ai replace humans": "AI can automate some tasks, but it is unlikely to fully replace humans because it lacks creativity, emotions, and ethical reasoning.",
        "programming": "Programming is writing instructions for computers to perform tasks.",
        "coding": "Coding is the process of writing code in a programming language.",
        "neural network": "A neural network is a type of machine learning model inspired by the human brain.",
        "cloud computing": "Cloud computing delivers computing services over the internet.",
        "blockchain": "Blockchain is a secure, distributed ledger technology.",
        "cryptocurrency": "Cryptocurrency is a digital currency that uses cryptography for security.",
        "bitcoin": "Bitcoin is the first and most well-known cryptocurrency.",
        "chatbot": "A chatbot is software that simulates conversation with users.",
        "algorithm": "An algorithm is a set of steps to solve a problem.",
        "data mining": "Data mining is the process of discovering patterns in large data sets.",
        "big data": "Big data refers to very large and complex data sets.",
        "internet of things": "The Internet of Things (IoT) is a network of physical devices connected to the internet.",
        "cybersecurity": "Cybersecurity is protecting computer systems from theft or damage.",
        "ethical hacking": "Ethical hacking is testing systems for security weaknesses legally.",
        "virtual reality": "Virtual reality is a computer-generated environment that simulates real life.",
        "augmented reality": "Augmented reality overlays digital content on the real world.",
        "5g": "5G is the fifth generation of wireless technology offering faster speeds.",
        "quantum computing": "Quantum computing uses quantum-mechanical phenomena to perform computation.",
        "server": "A server is a computer that provides data to other computers.",
        "api": "An API is a set of rules that lets programs communicate with each other.",
        "open source": "Open source means software whose source code is freely available.",
        "version control": "Version control helps track changes to code over time.",
        "github": "GitHub is a platform for hosting and sharing code using Git.",
        "git": "Git is a version control system for tracking changes in files.",
        "compiler": "A compiler translates code from a programming language into machine code.",
        "interpreter": "An interpreter executes code line by line.",
        "html": "HTML is the standard markup language for creating web pages.",
        "css": "CSS is used to style HTML elements.",
        "javascript": "JavaScript is a programming language for interactive web pages.",
        "database": "A database is a system for storing and organizing data.",
        "sql": "SQL is a language for managing data in a database.",
        "noSQL": "NoSQL databases store data differently than traditional relational databases.",
        "json": "JSON is a lightweight format for exchanging data.",
        "xml": "XML is a markup language for storing and transporting data.",
        "machine vision": "Machine vision enables computers to interpret visual information.",
        "reinforcement learning": "Reinforcement learning is training AI through rewards and penalties.",
        "supervised learning": "Supervised learning uses labeled data to train models.",
        "unsupervised learning": "Unsupervised learning finds patterns in data without labels.",
        "overfitting": "Overfitting is when a model learns the training data too well but fails on new data.",
        "underfitting": "Underfitting is when a model is too simple to capture data patterns.",
        "bias in ai": "Bias in AI refers to unfair or prejudiced results from a model.",
        "dataset": "A dataset is a collection of data used for training or analysis.",
        "feature in machine learning": "A feature is an individual measurable property of data.",
        "label in machine learning": "A label is the output value the model tries to predict.",
        "clustering": "Clustering is grouping similar data points together.",
        "classification": "Classification assigns data to predefined categories.",
        "ai": "AI or Artificial Intelligence is used to make machines smarter.",
        "regression": "Regression predicts continuous values from data.",
        "loss function": "A loss function measures how well a model's predictions match the actual values.",
        "backpropagation": "Backpropagation is a method to train neural networks by adjusting weights.",
        "gradient descent": "Gradient descent is an algorithm for minimizing loss functions.",
        "activation function": "An activation function decides whether a neuron fires in a neural network.",
        "tensorflow": "TensorFlow is an open-source machine learning library.",
        "pytorch": "PyTorch is an open-source machine learning library for deep learning.",
        "scikit learn": "Scikit-learn is a Python library for machine learning.",
        "sentiment analysis": "Sentiment analysis determines the emotional tone behind text.",
        "tokenization": "Tokenization splits text into words or pieces.",
        "stemming": "Stemming reduces words to their root forms.",
        "lemmatization": "Lemmatization reduces words to their base forms using vocabulary and grammar.",
        "speech recognition": "Speech recognition converts spoken words into text.",
        "computer vision": "Computer vision allows computers to interpret and process visual information.",
        "face recognition": "Face recognition identifies or verifies a person using their face.",
        "object detection": "Object detection identifies and locates objects in an image.",
        "edge computing": "Edge computing processes data near the source of data generation.",
        "devops": "DevOps is a set of practices that combines software development and IT operations.",
        "container": "A container is a lightweight, portable unit for running software.",
        "docker": "Docker is a platform to build, run, and ship containers.",
        "kubernetes": "Kubernetes is a system for automating deployment and management of containers.",
        "virtualization": "Virtualization allows multiple virtual machines to run on one physical machine.",
        "multithreading": "Multithreading allows multiple parts of a program to run at the same time.",
        "concurrency": "Concurrency means executing multiple tasks at overlapping times.",
        "parallelism": "Parallelism means running multiple tasks simultaneously.",
        "recursion": "Recursion is when a function calls itself.",
        "operating system": "An operating system manages hardware and software resources.",
        "linux": "Linux is a free, open-source operating system.",
        "windows os": "Windows is an operating system developed by Microsoft.",
        "macos": "macOS is an operating system developed by Apple.",
        "virtual machine": "A virtual machine is software that emulates a computer system.",
        "encryption": "Encryption is converting data into a coded form to protect it.",
        "decryption": "Decryption is converting encrypted data back to its original form.",
        "rsa": "RSA is a public-key encryption algorithm.",
        "hashing": "Hashing converts data into a fixed-size string of characters.",
        "firewall": "A firewall controls incoming and outgoing network traffic.",
        "vpn": "A VPN creates a secure connection over the internet.",
        "phishing": "Phishing is a cyberattack where fake messages trick users into revealing information.",
        "malware": "Malware is malicious software designed to harm a computer.",
        "ransomware": "Ransomware is malware that locks data and demands payment to unlock it.",
        "sql injection": "SQL injection is a type of cyberattack targeting databases.",
        "bug": "A bug is an error in a program that causes it to work incorrectly.",
        "debugging": "Debugging is the process of finding and fixing bugs.",
        "testing": "Testing checks that software works as expected.",
        "unit testing": "Unit testing checks individual parts of a program.",
        "integration testing": "Integration testing checks if different parts of a program work together.",
        "continuous integration": "Continuous integration is frequently merging code changes into a shared repository.",
        "agile": "Agile is a software development approach focused on iterative progress and flexibility.",
        "scrum": "Scrum is an Agile framework for managing projects.",
        "internet": "The internet is a global network that connects computers and devices.",
        "browser": "A browser is software for accessing the web.",
        "email": "Email is a method of exchanging digital messages over the internet.",
        "robotics": "Robotics is the design and use of robots for tasks.",
        "automation": "Automation means using technology to perform tasks without human input.",
        "hardware": "Hardware refers to the physical components of a computer.",
        "software": "Software refers to programs and data used by a computer.",
        "microprocessor": "A microprocessor is the central unit of a computer that processes instructions.",
        "sensor": "A sensor detects changes in the environment and sends data.",
        "compiler": "A compiler translates code from a programming language to machine code.",
        "router": "A router directs data between networks.",
        "network": "A network connects computers so they can share data.",
        "protocol": "A protocol is a set of rules for data exchange.",
        "ip": "IP stands for Internet Protocol and is used for addressing devices on a network.",
        "url": "A URL is the address of a web page.",
        "domain": "A domain is the name of a website on the internet.",
        "hosting": "Hosting is a service that stores and serves website files.",
        "cookie": "A cookie is a small file stored by a browser to remember info.",
        "cache": "Cache stores temporary data for faster access.",
        "thread": "A thread is the smallest unit of processing in a program.",
        "process": "A process is a running instance of a program.",
        "shell": "A shell is a command-line interface for interacting with the OS.",
        "command": "A command tells the computer to perform an action.",
        "syntax": "Syntax defines rules for writing code correctly.",
        "variable": "A variable stores data in a program.",
        "function": "A function is a reusable block of code.",
        "class": "A class defines a blueprint for objects in object-oriented programming.",
        "object": "An object is an instance of a class.",
        "inheritance": "Inheritance lets a class take properties from another class.",
        "polymorphism": "Polymorphism allows objects to take on many forms.",
        "interface": "An interface defines methods that a class must implement.",
        "exception": "An exception is an error detected during program execution.",
        "threading": "Threading allows multiple tasks to run at once in a program.",
        "database": "A database organizes and stores data for easy access.",
        "table": "A table organizes data in rows and columns in a database.",
        "index": "An index speeds up data retrieval in a database.",
        "view": "A view is a virtual table in a database.",
        "cursor": "A cursor points to data in a database for operations.",
        "transaction": "A transaction is a sequence of database operations treated as a unit.",
        "commit": "Commit saves database changes permanently.",
        "rollback": "Rollback undoes changes made during a transaction.",
        "schema": "A schema defines the structure of a database.",
        "primary": "A primary key uniquely identifies rows in a table.",
        "foreign": "A foreign key links two database tables.",
        "normalization": "Normalization organizes data to reduce redundancy.",
        "denormalization": "Denormalization adds redundancy for faster reads.",
        "key": "A key identifies data in a database.",
        "query": "A query requests data from a database.",
        "weather": "I'm not connected to live data, but I hope it's nice where you are!",
        "music": "Music is a wonderful form of art and expression.",
        "movie": "Movies are stories brought to life on screen.",
        "book": "Books are a great way to learn and explore new worlds.",
        "animal": "Animals are living creatures that share our world.",
        "plant": "Plants give us oxygen and make our planet beautiful.",
        "country": "A country is a distinct region with its own government.",
        "city": "A city is a large, populated area with many buildings and services.",
        "neurons": "Something that I dont have in real life like humans have, but I have virtual neurons 😎",
        "food": "Food keeps us healthy and gives us energy.",
        "fruit": "Fruits are sweet and nutritious parts of plants.",
        "vegetable": "Vegetables are plants eaten as food, often healthy!",
        "sport": "Sports are games or activities that involve physical effort and skill.",
        "game": "Games are activities for fun, challenge, or competition.",
        "hobby": "A hobby is something you do for fun in your free time.",
        "travel": "Travel lets you explore new places and cultures.",
        "language": "A language is a system of communication used by people.",
        "culture": "Culture is the customs and traditions of a group.",
        "festival": "Festivals are celebrations of culture or religion.",
        "holiday": "Holidays are special days for rest or celebration.",
        "art": "Art expresses ideas and emotions in creative ways.",
        "painting": "Painting is creating pictures using colors.",
        "dance": "Dance is moving your body to music for expression or joy.",
        "poem": "A poem is a piece of writing that expresses feelings or ideas in a special form.",
        "history": "History is the study of past events.",
        "geography": "Geography is the study of Earth's features and places.",
        "ocean": "Oceans are vast bodies of salt water that cover most of Earth.",
        "mountain": "A mountain is a large natural elevation of Earth's surface.",
        "river": "A river is a large stream of water flowing to the sea.",
        "desert": "A desert is a dry region with little rainfall.",
        "forest": "A forest is a large area covered mainly with trees.",
        "bird": "Birds are animals with feathers and wings.",
        "flower": "Flowers are the colorful parts of plants that often produce seeds.",
        "pet": "Pets are animals kept for companionship.",
        "friend": "A friend is someone you care about and trust.",
        "family": "Family is a group of people related by blood or close bonds.",
        "love": "Love is a strong feeling of affection and care.",
        "happiness": "Happiness is a feeling of joy and contentment.",
        "health": "Health means being well in body and mind.",
        "exercise": "Exercise keeps your body fit and healthy.",
        "sleep": "Sleep is essential for rest and recovery.",
        "dream": "A dream is a series of thoughts or images during sleep.",
        "time": "Time is how we measure the progression of events.",
        "money": "Money is used to buy goods and services.",
        "job": "A job is work you do in exchange for pay.",
        "school": "School is a place where people go to learn.",
        "teacher": "A teacher helps students gain knowledge and skills.",
        "student": "A student is someone who is learning something.",
        "universe": "The universe is all of space, time, matter, and energy that exists.",
        "galaxy": "A galaxy is a massive system of stars, planets, gas, and dust bound together by gravity.",
        "star": "A star is a massive ball of burning gas that produces light and heat.",
        "planet": "A planet is a large body that orbits a star.",
        "sun": "The Sun is the star at the center of our solar system.",
        "moon": "A moon is a natural satellite that orbits a planet.",
        "solar": "The solar system includes the Sun and all objects that orbit it.",
        "earth": "Earth is the third planet from the Sun and our home.",
        "mars": "Mars is the fourth planet from the Sun, known as the red planet.",
        "gravity": "Gravity is the force that pulls objects toward each other.",
        "light": "Light is electromagnetic radiation that makes vision possible.",
        "sound": "Sound is a type of wave created by vibrating objects.",
        "energy": "Energy is the capacity to do work.",
        "matter": "Matter is anything that has mass and takes up space.",
        "atom": "An atom is the basic unit of matter.",
        "element": "An element is a pure substance made of only one type of atom.",
        "water": "Water is a colorless, tasteless liquid essential for life.",
        "air": "Air is the mixture of gases that we breathe.",
        "fire": "Fire is rapid oxidation producing heat and light.",
        "rain": "Rain is water falling from clouds as droplets.",
        "snow": "Snow is frozen water crystals falling from the sky.",
        "wind": "Wind is moving air caused by differences in air pressure.",
        "temperature": "Temperature measures how hot or cold something is.",
        "climate": "Climate is the average weather conditions over time.",
        "season": "A season is a period of the year with particular weather patterns.",
        "volcano": "A volcano is an opening in Earth's crust that can erupt with lava.",
        "earthquake": "An earthquake is the shaking of the ground due to tectonic movements.",
        "tsunami": "A tsunami is a large ocean wave caused by an underwater earthquake.",
        "continent": "A continent is a large continuous area of land on Earth.",
        "island": "An island is a piece of land surrounded by water.",
        "destruction": "Destruction means great damage or ruin.",
        "peace": "Peace is a state of harmony and absence of conflict.",
        "war": "War is a conflict between groups or countries using force.",
        "democracy": "Democracy is a form of government where people choose leaders by voting.",
        "economy": "An economy is the system of production and consumption in a country.",
        "currency": "Currency is money used in a particular country.",
        "trade": "Trade is the exchange of goods and services.",
        "population": "Population refers to the number of people living in a place.",
        "education": "Education is the process of learning and gaining knowledge.",
        "science": "Science is the study of the natural world through observation and experiment.",
        "philosophy": "Philosophy is the study of ideas about knowledge, truth, and meaning.",
        "psychology": "Psychology is the study of the mind and behavior.",
        "biology": "Biology is the science of living things.",
        "chemistry": "Chemistry is the science of substances and how they change.",
        "physics": "Physics is the study of matter, energy, and the forces of nature.",
        "math": "Math is the study of numbers, shapes, and patterns.",
        "statistics": "Statistics is the study of data collection, analysis, and interpretation.",
        "logic": "Logic is reasoning conducted according to strict principles.",
        "computer": "Computer is an electronic machine used to do tasks like gaming, coding etc. It was originally made for doing calculations.",
        "printer": "Printer is an output device which prints hard copies of images or texts.",
        "scanner": "Scanner is an input device used to scan hard copies of some image or text and convert it into soft copy.",
        "calculator": "Calculator is a device used to solve math problems easily.",
        "wikipedia": "Wikipedia is a non-profit free encyclopedia consisting of different articles.",
        "speaker": "Speaker is an output device which lets us hear to music.",
        "projector": "Projector is an output device which works like a monitor but can project the screen on a bigger area.",
        "monitor": "Monitor is an output device used to see the output of the results of the computer.",
        "mouse": "Mouse is an input device used to point and click things on the computer.",
        "keyboard": "Keyboard is an input device used to type letters in the computer.",
        "arduino": "Arduino is a microcontroller board used by many people for DIY (Do It Yourself) projects.",
        "ups": "UPS is a device used to retain power during power outages. It is mainly used in computers.",
        "culture": "Culture refers to the customs, arts, social institutions, and achievements of a particular nation or people.",
        "history": "History is the study of past events, particularly in human affairs.",
        "nature": "Nature refers to the physical world and everything in it not created by humans.",
        "universe": "The universe is all of space, time, matter, and energy that exists.",
        "friendship": "Friendship is a close and trusting relationship between people, which is most of the time fake!",
        "freedom": "Freedom is the power or right to act, speak, or think as one wants without restraint.",
          "thanks": "You're welcome!",
        "earth": "Earth is the only known planet that supports life.",
  "sun": "The Sun is a star and the center of our solar system.",
  "moon": "The Moon is Earth's only natural satellite.",
  "ocean": "The Pacific Ocean is the largest ocean on Earth.",
  "mountain": "Mount Everest is the highest mountain in the world.",
  "river": "The Nile is considered the longest river in the world.",
  "country": "There are 195 countries in the world today.",
  "capital": "A capital city is where the government of a country is based.",
  "india": "India is the 7th largest country by area and second most populous.",
  "usa": "The United States of America is a country in North America.",
  "president": "A president is the elected head of a republican state.",
  "prime minister": "The Prime Minister is the head of the government in many countries.",
  "oxygen": "Oxygen is the gas essential for respiration.",
  "water": "Water makes up about 71% of Earth's surface.",
  "continent": "There are 7 continents on Earth.",
  "africa": "Africa is the second largest continent and rich in biodiversity.",
  "asia": "Asia is the largest and most populous continent.",
  "antarctica": "Antarctica is the coldest continent.",
  "gravity": "Gravity is the force that pulls things toward the center of Earth.",
  "wtf": "Sorry, if the answer given by me made you say this.",      
  "photosynthesis": "Photosynthesis is how plants make their food using sunlight.",
  "atom": "An atom is the smallest unit of matter.",
  "cell": "A cell is the basic unit of all living organisms.",
  "human": "Humans are the most intelligent species known.",
  "brain": "The brain is the control center of the human body.",
  "heart": "The heart pumps blood throughout the body.",
  "lungs": "Lungs help in the exchange of oxygen and carbon dioxide.",
  "blood": "Blood circulates oxygen and nutrients to the body.",
  "bone": "Bones provide structure and protection to the body.",
  "eye": "The human eye helps us to see.",
  "ear": "The ear enables us to hear and maintain balance.",
  "volcano": "A volcano is an opening in Earth's crust that can erupt lava.",
  "desert": "The Sahara is the largest hot desert in the world.",
  "rainforest": "Rainforests are dense forests found in tropical areas.",
  "planet": "There are 8 planets in our solar system.",
  "mars": "Mars is known as the Red Planet.",
  "jupiter": "Jupiter is the largest planet in the solar system.",
  "saturn": "Saturn is famous for its rings.",
  "venus": "Venus is the hottest planet in the solar system.",
  "mercury": "Mercury is the closest planet to the Sun.",
  "uranus": "Uranus rotates on its side and has faint rings.",
  "neptune": "Neptune is the farthest planet from the Sun.",
  "galaxy": "A galaxy is a massive system of stars, gas, and dust.",
  "milky way": "The Milky Way is the galaxy that contains our solar system.",
  "star": "Stars are massive balls of burning gases.",
  "universe": "The universe includes all of space and everything in it.",
  "math": "Mathematics is the study of numbers, shapes, and patterns.",
  "science": "Science explains how things work in the natural world.",
  "physics": "Physics is the study of matter and energy.",
  "chemistry": "Chemistry is the study of substances and their interactions.",
  "biology": "Biology is the study of living organisms.",
  "lol": "Haha, glad you found that funny!",
  "wow": "Amazing, right?",
  "python": "Python is a simple and powerful programming language.",
  "ai": "AI stands for Artificial Intelligence.",
  "weather": "I can't check live weather, but I hope it's nice!",
  "another joke": "Why don’t robots have brothers? Because they all share the same motherboard!",
  "bored": "Try reading, drawing, or coding something fun!",
  "hungry": "Maybe grab a snack or some food?",
  "tired": "You should take a rest!",
  "school": "School is a great place to learn and grow.",
  "exam": "Stay calm and revise — you’ve got this!",
  "music": "Music is food for the soul!",
  "movie": "What's your favorite movie?",
  "game": "Games are a fun way to relax.",
  "robot": "I'm kind of like a robot, but cooler 😎",
  "chatbot": "That's me! A friendly keyword-based bot.",
  "love": "Love makes life beautiful.",
  "happy": "I'm glad to hear that!",
  "sad": "I'm here if you need someone to chat with.",
  "angry": "Try taking deep breaths and calming down.",
  "help": "Sure! What do you need help with?",
  "name": "You can call me XyloAI!",
  "fun": "Let's keep chatting. That’s fun, right?",
  "friend": "Friends make everything better. Not always 🤨",
  "cool": "Thanks! You're cool too.",
  "your gender": "My gender is male!",
  "ok": "Okay!",
  "easter eggs": "Oh wow you have found the easter egg.",
  "idk": "That’s alright. Let's figure it out together!"
}
